PART-1

In [3]:
import pandas as pd  # load file
store_sales=pd.read_csv('Desktop/store_sales _COE.csv')

In [4]:
store_sales.head(5) # displays first 5 rows
store_sales.tail(5) # displays first 5 cols

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
95,S_96,Texas,7,10,20,20,10,15,15,21,15,7,23,22
96,S_97,California,13,6,7,15,22,10,21,23,10,6,12,9
97,S_98,Texas,16,9,6,14,20,13,11,10,8,22,17,22
98,S_99,Arizona,18,16,9,5,12,22,11,13,21,17,19,10
99,S_100,California,5,23,17,24,15,21,19,10,12,20,5,9

In [5]:
print(store_sales.shape) # displays count of rows and cols
print(store_sales.dtypes) # displays dtpes
print(store_sales.count()) # not null count

(100, 14)
store_id    object
city        object
Jan          int64
Feb          int64
Mar          int64
Apr          int64
May          int64
Jun          int64
July         int64
Aug          int64
Sep          int64
Oct          int64
Nov          int64
Dec          int64
dtype: object
store_id    100
city        100
Jan         100
Feb         100
Mar         100
Apr         100
May         100
Jun         100
July        100
Aug         100
Sep         100
Oct         100
Nov         100
Dec         100
dtype: int64

In [6]:
print(store_sales.columns.tolist()) # columns names
print(store_sales.describe())  # statistical info of columns

['store_id', 'city', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'July', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
              Jan         Feb         Mar         Apr         May         Jun  \
count  100.000000  100.000000  100.000000  100.000000  100.000000  100.000000
mean    14.460000   15.090000   14.560000   14.570000   13.560000   13.800000
std      5.712683    6.055459    5.782803    4.965039    5.883241    5.962848
min      5.000000    5.000000    5.000000    5.000000    5.000000    5.000000
25%     10.000000    9.000000    9.750000   11.000000    8.000000    9.000000
50%     15.000000   16.000000   15.000000   14.500000   13.000000   13.500000
75%     19.000000   21.000000   19.250000   19.000000   19.000000   19.000000
max     24.000000   24.000000   24.000000   24.000000   24.000000   24.000000

             July         Aug         Sep        Oct         Nov         Dec
count  100.000000  100.000000  100.000000  100.00000  100.000000  100.000000
mean    14.380000   15.810000   14.910000   14.10000   15.310000   13.570000
std      5.566458    6.152432    5.284043    5.87496    6.461533    5.852143
min      5.000000    5.000000    5.000000    5.00000    5.000000    5.000000
25%     10.000000   11.000000   11.000000    9.00000   10.000000    8.000000
50%     15.000000   17.000000   14.500000   14.00000   16.000000   13.000000
75%     19.000000   21.000000   19.000000   19.00000   21.250000   19.000000
max     24.000000   24.000000   24.000000   24.00000   24.000000   24.000000

In [7]:
total=store_sales[['Jan','Feb','Mar','Apr']].sum() # sum of sales from jan-apr
total

Jan    1446
Feb    1509
Mar    1456
Apr    1457
dtype: int64

In [8]:
avg=store_sales[['Jan','Feb','Mar','Apr']].mean() # avg of sales from jan-apr
avg

Jan    14.46
Feb    15.09
Mar    14.56
Apr    14.57
dtype: float64

In [9]:
Year= store_sales[['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'July', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']].sum(axis=1) # year sales of all stores--> axis=1--cols
Year

0     178
1     174
2     181
3     135
4     159
     ...
95    185
96    154
97    168
98    173
99    180
Length: 100, dtype: int64

PART-2

In [10]:
month = store_sales.groupby('city')[['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'July', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']].sum() # each month total sales of cities
month

            Jan  Feb  Mar  Apr  May  Jun  July  Aug  Sep  Oct  Nov  Dec
city
Arizona     341  336  320  329  310  332   322  341  337  329  361  293
California  634  668  629  601  570  589   637  698  640  614  657  585
Texas       471  505  507  527  476  459   479  542  514  467  513  479

In [11]:
avg_month = store_sales.groupby('city')[['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun','July', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']].mean() # ecah month avg sales of cities 
avg_month

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
city,,,,,,,,,,,,
Arizona,15.500000,15.272727,14.545455,14.954545,14.090909,15.090909,14.636364,15.500000,15.318182,14.954545,16.409091,13.318182
California,14.744186,15.534884,14.627907,13.976744,13.255814,13.697674,14.813953,16.232558,14.883721,14.279070,15.279070,13.604651
Texas,13.457143,14.428571,14.485714,15.057143,13.600000,13.114286,13.685714,15.485714,14.685714,13.342857,14.657143,13.685714

In [12]:
avg_month['Overall_Avg'] = avg_month.mean(axis=1)
highest_city = avg_month['Overall_Avg'].idxmax() # City with the highest average sales
highest_value = avg_month['Overall_Avg'].max()   # avg sales value
print(f"highest average sales: {highest_city}({highest_value})")

highest average sales: Arizona(14.965909090909092)

In [15]:
avg_month['total'] = avg_month.sum(axis=1)
lowest_city = avg_month['total'].idxmin() # City with the lowest total sales
lowest_value = avg_month['total'].min()   # total sales value
print(f"lowest total sales: {lowest_city}({lowest_value})")

lowest total sales: Texas(551.4785714285713)

In [24]:
store_sales['total_sales']=store_sales[['Jan','Feb','Mar','Apr']].sum(axis=1) # total_sales by adding jan+Feb+Mar+Apr
sales = store_sales.sort_values(by='total_sales', ascending=False)    # sort by total_sales value and display top3
sales.head(3)

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales
72,S_73,California,20,24,24,18,7,22,12,21,20,18,21,6,86
77,S_78,Arizona,19,23,19,24,13,12,24,17,22,16,17,5,85
69,S_70,Texas,24,16,24,20,14,21,15,13,18,22,10,9,84

PART-3

In [25]:
sales.head(5) # top 5 highest by total_sales

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales
72,S_73,California,20,24,24,18,7,22,12,21,20,18,21,6,86
77,S_78,Arizona,19,23,19,24,13,12,24,17,22,16,17,5,85
69,S_70,Texas,24,16,24,20,14,21,15,13,18,22,10,9,84
26,S_27,California,24,19,13,24,8,12,6,21,10,10,12,20,80
85,S_86,California,15,23,24,18,21,17,23,13,12,11,24,13,80

In [28]:
sales_lowest= store_sales.sort_values(by='total_sales', ascending=False)  # bottom 5 rows with lowest sales
sales_lowest.tail(5)

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales
96,S_97,California,13,6,7,15,22,10,21,23,10,6,12,9,41
82,S_83,California,16,5,6,12,20,21,17,6,12,9,22,15,39
21,S_22,Texas,12,8,6,13,12,10,11,11,15,23,9,16,39
18,S_19,California,7,6,17,8,21,11,20,9,11,22,21,8,38
90,S_91,Texas,14,5,5,9,18,6,11,13,17,9,10,15,33

In [32]:
max_store = store_sales.loc[store_sales['Mar'].idxmax()] # max march city value 
print(f"{max_store['city']} (-->{max_store['Mar']})")

Texas (-->24)

In [33]:
min_store = store_sales.loc[store_sales['Apr'].idxmin()] # min April city value 
print(f"{min_store['city']} (-->{min_store['Apr']})")

Arizona (-->5)

In [39]:
store_sales['avg_monthly_sales'] = store_sales[['Jan','Feb','Mar','Apr','May','Jun','July','Aug','Sep','Oct','Nov','Dec']].mean(axis=1)
stores_15 = store_sales[store_sales['avg_monthly_sales'] > 15]   # Filter stores with avg monthly sales > 15
count_city = stores_15.groupby('city')['store_id'].count()   # Count number of such stores in each city
print("Number of stores in each city with average monthly sales > 15:")
count_city

Number of stores in each city with average monthly sales > 15:

city
Arizona       13
California    13
Texas          9
Name: store_id, dtype: int64

In [40]:
california_sales = store_sales[(store_sales['city'] == 'California') &(store_sales[['Jan','Feb','Mar','Apr','May','Jun','July','Aug','Sep','Oct','Nov','Dec']] > 20).any(axis=1)]
print(california_sales) # sales of california with sales>20

   store_id        city  Jan  Feb  Mar  Apr  May  Jun  July  Aug  Sep  Oct  \
1       S_2  California   12   19   15   15   11   19     7   15   10   11
2       S_3  California   16   16   14   19   23    6    13   13   15   14
5       S_6  California   14   21   18   20   21    5    18   24    7   12
7       S_8  California   15    8    5   15   12   21    17   19   13    6
9      S_10  California   14   23   20   11   12   13    19    6    5   22
11     S_12  California    6   18   21    8    5    8    11    9   21   17
15     S_16  California   18    9    8    9   21    7    19   18   21    7
16     S_17  California   13    8    7   22   21   24    18    5   24   18
18     S_19  California    7    6   17    8   21   11    20    9   11   22
19     S_20  California   11   21   20    6    5   24    14   23   19   10
23     S_24  California    5   17   19   19   19   14    18   23   23    5
25     S_26  California   24   11   16   11   13   14    10   15    7   15
26     S_27  California   24   19   13   24    8   12     6   21   10   10
27     S_28  California   10   15   24   21    9   22    10   19   13   18
28     S_29  California   15    8   10   16   12   10    21   21    7   13
30     S_31  California   14   19    6   15   24   13    14   23   13   24
34     S_35  California   10    7   24   15   12   24    12   17   10   14
36     S_37  California   24   16    9    6    6   22     6    8   24    6
37     S_38  California   21   10   13   11   11   14    24   24   24   21
44     S_45  California   19   17    9   17    8    8    16    5   21   20
48     S_49  California   22   22   10   11   17   13    18   11   12   20
58     S_59  California   15   13   20    8    7   12    15    8   24    9
59     S_60  California    6   21   22    8    6   17    21   12   14   15
61     S_62  California   16   21    6   22   22    9    21   21   22   17
63     S_64  California   12   18    9   19    5    7    22   23   19    6
67     S_68  California   23   15   16   14    8   12    10   21   10    7
72     S_73  California   20   24   24   18    7   22    12   21   20   18
73     S_74  California   20   17   14    5   22    9    18   24   11   10
76     S_77  California    9   18   10   15   14   14    16    5   24   11
80     S_81  California   22    9   20   12    6   20     8   16   15   14
82     S_83  California   16    5    6   12   20   21    17    6   12    9
83     S_84  California   13   12   12    5    7   16    12   21   20   19
85     S_86  California   15   23   24   18   21   17    23   13   12   11
89     S_90  California    8   23   21   14   15    6     5   14   23    8
91     S_92  California   14   16   17   13   13   10    17   23    7   23
92     S_93  California   20   13   15   12   15   19    21   22   10   21
93     S_94  California   19   18   14   21    5    7     8   21   11   21
94     S_95  California   10   22   13   20    5    5     9   15   23   23
96     S_97  California   13    6    7   15   22   10    21   23   10    6
99    S_100  California    5   23   17   24   15   21    19   10   12   20

    Nov  Dec  total_sales  avg_monthly_sales
1    21   19           61          14.500000
2    24    8           65          15.083333
5    11    5           73          14.666667
7    24   15           43          14.166667
9    17   16           68          14.833333
11   18   22           53          13.666667
15    7   23           44          13.916667
16   12   17           50          15.750000
18   21    8           38          13.416667
19   21   22           58          16.333333
23   16    5           60          15.250000
25    5    8           62          12.416667
26   12   20           80          14.916667
27   24    6           70          15.916667
28    8    5           49          12.166667
30   10    9           54          15.333333
34    5   18           56          14.000000
36    5   11           55          11.916667
37   16   18           55          17.250000
44   12   24           62          14.666667
48   12    9           65          14.750000
58   21    6           56          13.166667
59   10   15           57          13.916667
61   16   21           65          17.833333
63   15   17           58          14.333333
67   24   17           68          14.750000
72   21    6           86          17.750000
73   20   19           56          15.750000
76   18   17           52          14.250000
80   24   10           63          14.666667
82   22   15           39          13.416667
83   22   13           42          14.333333
85   24   13           80          17.833333
89    5   21           66          13.583333
91   10   22           60          15.416667
92   23   13           60          17.000000
93   15    7           72          13.916667
94   24    7           65          14.666667
96   12    9           41          12.833333
99    5    9           69          15.000000

PART-4

In [44]:
month= ['Jan','Feb','Mar','Apr','May','Jun','July','Aug','Sep','Oct','Nov','Dec'] # months cols
group = store_sales.groupby('city')[month] # group city with cols
city= group.agg(['mean','max','min']) # apply statistics to group
print(city)

                  Jan                Feb                Mar          \
                 mean max min       mean max min       mean max min
city
Arizona     15.500000  23   7  15.272727  24   6  14.545455  24   5
California  14.744186  24   5  15.534884  24   5  14.627907  24   5
Texas       13.457143  24   5  14.428571  24   5  14.485714  24   5

                  Apr  ... Sep        Oct                Nov          \
                 mean  ... min       mean max min       mean max min
city                   ...
Arizona     14.954545  ...   8  14.954545  24   5  16.409091  24   5
California  13.976744  ...   5  14.279070  24   5  15.279070  24   5
Texas       15.057143  ...   6  13.342857  24   5  14.657143  24   6

                  Dec
                 mean max min
city
Arizona     13.318182  24   5
California  13.604651  24   5
Texas       13.685714  24   5

[3 rows x 36 columns]

In [52]:
# If you grouped with monthly columns
group = store_sales.groupby('city')[['Jan','Feb','Mar','Apr','May','Jun','July','Aug','Sep','Oct','Nov','Dec']]
# Average March sales per city
march_val = group.mean()['Mar']  # Take the 'Mar' column AFTER .mean()
highest_march = march_val.idxmax() 
highest_value = march_val.max()
print(f"{highest_march} ({highest_value})")

California (14.627906976744185)

In [54]:
city_overall_avg = store_sales.groupby('city')[month].mean().mean(axis=1) #overall avg sales of cities
print(city_overall_avg)

city
Arizona       14.965909
California    14.577519
Texas         14.140476
dtype: float64

In [55]:
# Sum sales for each month across all cities
month_totals = store_sales[month].sum()
highest_month = month_totals.idxmax() # highest over all sales of month
highest_month_value = month_totals.max()
print(f"Month with the highest overall sales: {highest_month} ({highest_month_value})")

Month with the highest overall sales: Aug (1581)

In [56]:
# Sum sales per city for each month
city_month_totals = store_sales.groupby('city')[month].sum()
# Month with maximum sales for each city
max_month_per_city = city_month_totals.idxmax(axis=1)
print(max_month_per_city)

city
Arizona       Nov
California    Aug
Texas         Aug
dtype: object

In [59]:
store_sales['Average_Sales'] = store_sales[month].mean(axis=1) #avg of s
store_sales['Average_Sales']

0     14.833333
1     14.500000
2     15.083333
3     11.250000
4     13.250000
        ...
95    15.416667
96    12.833333
97    14.000000
98    14.416667
99    15.000000
Name: Average_Sales, Length: 100, dtype: float64